# todo: Определить в коде  переменные:

##1. Целочисленного типа
##2. Вещественного типа
##3. Логического типа
##4. Строкового типа
##5. Пустого типа
##
##Вывести все их типы.


#int
variable = 1
print (variable, type (variable))

#float
variable = 1.1
print (variable, type (variable))

#Boolean
variable = True
print (variable, type (variable))

#str
variable = "Text"
print (variable, type (variable))

#None
variable = None
print (variable, type (variable))
